
#### Terragrunt Plan `success`
<details><summary>Show Plan</summary>
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.gratibot_app_service will be created
  + resource "azurerm_app_service" "gratibot_app_service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = true
      + client_cert_enabled               = false
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = true
      + id                                = (known after apply)
      + location                          = "centralus"
      + name                              = "gratibot-app-service"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "gratibot-azure-data"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + always_on                   = true
          + dotnet_framework_version    = "v4.0"
          + ftps_state                  = (known after apply)
          + http2_enabled               = false
          + ip_restriction              = (known after apply)
          + linux_fx_version            = "DOCKER|docker.io/grantesparza/gratibot:v0.1.0"
          + local_mysql_enabled         = (known after apply)
          + managed_pipeline_mode       = (known after apply)
          + min_tls_version             = (known after apply)
          + number_of_workers           = (known after apply)
          + remote_debugging_enabled    = false
          + remote_debugging_version    = (known after apply)
          + scm_ip_restriction          = (known after apply)
          + scm_type                    = (known after apply)
          + scm_use_main_ip_restriction = false
          + websockets_enabled          = (known after apply)
          + windows_fx_version          = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.gratibot_app_service_plan will be created
  + resource "azurerm_app_service_plan" "gratibot_app_service_plan" {
      + id                           = (known after apply)
      + kind                         = "Linux"
      + location                     = "centralus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "gratibot-service-plan"
      + reserved                     = true
      + resource_group_name          = "gratibot-azure-data"

      + sku {
          + capacity = 3
          + size     = "P2v2"
          + tier     = "PremiumV2"
        }
    }

  # azurerm_cosmosdb_account.db_account will be created
  + resource "azurerm_cosmosdb_account" "db_account" {
      + analytical_storage_enabled        = false
      + connection_strings                = (sensitive value)
      + enable_automatic_failover         = true
      + enable_free_tier                  = false
      + enable_multiple_write_locations   = false
      + endpoint                          = (known after apply)
      + id                                = (known after apply)
      + is_virtual_network_filter_enabled = false
      + kind                              = "MongoDB"
      + location                          = "centralus"
      + name                              = "gratibot-cosmos-acc"
      + offer_type                        = "Standard"
      + primary_key                       = (sensitive value)
      + primary_master_key                = (sensitive value)
      + primary_readonly_key              = (sensitive value)
      + primary_readonly_master_key       = (sensitive value)
      + public_network_access_enabled     = true
      + read_endpoints                    = (known after apply)
      + resource_group_name               = "gratibot-azure-data"
      + secondary_key                     = (sensitive value)
      + secondary_master_key              = (sensitive value)
      + secondary_readonly_key            = (sensitive value)
      + secondary_readonly_master_key     = (sensitive value)
      + write_endpoints                   = (known after apply)

      + capabilities {
          + name = "EnableMongo"
        }

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 5
          + max_staleness_prefix    = 100
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "centralus"
        }
    }

  # azurerm_cosmosdb_mongo_database.mongo_db will be created
  + resource "azurerm_cosmosdb_mongo_database" "mongo_db" {
      + account_name        = "gratibot-cosmos-acc"
      + id                  = (known after apply)
      + name                = "gratibot-cosmos-mongo-db"
      + resource_group_name = "gratibot-azure-data"
      + throughput          = 400
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>